Grouping and aggregating helps you summarize your data — like answering:

“What’s the average salary per department?”<br>
“How many users joined the Gym per month?”

In [1]:
import pandas as pd
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
}) 
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

<h1>.groupby() Function</h1>
df.groupby() is used to group rows of a DataFrame based on the values in one or more columns, which allows you to then perform aggregate functions (like sum(), mean(), count(), etc.) on each group.

In [3]:
df.groupby("Department")["Salary"].mean()            #Group by Department, then calculate average Salary for each group

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

<h1>Common Aggregation Functions</h1>

In [4]:
df.groupby("Team")["Salary"].mean()     # Average per team
df.groupby("Team")["Salary"].sum()      # Total score
df.groupby("Team")["Salary"].count()    # How many entries
df.groupby("Team")["Salary"].min()
df.groupby("Team")["Salary"].max()

Team
A    90
B    85
C    92
D    80
Name: Salary, dtype: int64

To groupby multiple columns:

In [7]:
df.groupby(["Team","Gender"])["Age"].mean()

Team  Gender
A     F         25.0
      M         23.0
B     F         22.0
      M         30.0
C     F         26.0
      M         28.0
D     F         27.0
      M         21.0
Name: Age, dtype: float64

<h1>Custom Aggregations with .agg()</h1>
In pandas, .agg and .aggregate are exactly the same — they're aliases for the same method

In [8]:
df.groupby("Team")["Salary"].agg(["mean", "max", "min"])

      mean  max  min
Team
A     87.5   90   85
B     81.5   85   78
C     90.0   92   88
D     77.5   80   75

In [10]:
df.groupby("Team")["Salary"].agg(
    avg_score="mean",
    high_score="max"
)     # Name own function

      avg_score  high_score
Team
A          87.5          90
B          81.5          85
C          90.0          92
D          77.5          80

In [11]:
df.groupby("Team").agg({
    "Salary": "mean",
    "Age": "max"
})       #Apply different function to different columns

      Salary  Age
Team
A       87.5   25
B       81.5   30
C       90.0   28
D       77.5   27

<h1>Transform vs Aggregate vs Filter</h1>
<table>
  <thead>
    <tr>
      <th>Operation</th>
      <th>Returns</th>
      <th>When to Use</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>.aggregate()</td>
      <td>Single value per group</td>
      <td>Summary (like mean)</td>
    </tr>
    <tr>
      <td>.transform()</td>
      <td>Same shape as original</td>
      <td>Add new column based on group</td>
    </tr>
    <tr>
      <td>.filter()</td>
      <td>Subset of rows</td>
      <td>Keep/discard whole groups</td>
    </tr>
  </tbody>
</table>

In [14]:
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")
df     #each row gets its team average — great for comparisons!

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

In [16]:
df.groupby("Team").filter(lambda x: x["Salary"].mean() > 80)    #Only keeps teams with average score > 80.

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0

<h1>Summary:</h1>
<ul>
  <li><code>.groupby()</code> helps you summarize large datasets by category</li>
  <li>Use <code>mean()</code>, <code>sum()</code>, <code>count()</code>, <code>.agg()</code> for custom metrics</li>
  <li><code>.transform()</code> adds values back to original rows</li>
  <li><code>.filter()</code> keeps only groups that meet conditions</li>
</ul>